KanatERPSukhova.КанатАдаптация/src/Documents/ЗаказНаПроизводство2_2/ЗаказНаПроизводство2_2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="04b45cc8-19da-4fc2-ab25-fcf16e66f5ee">
  <name>ЗаказНаПроизводство2_2</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="f1e30099-86a8-4d01-b947-c8d4e48da517">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="0190487c-4b35-4793-bebb-cdc5d67bf079">
    <name>Продукция</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>КАНАТ_КомментарийКЗаказу</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>400</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КАНАТ_Сертификат</name>
      <type>
        <types>CatalogRef.КАНАТ_Сертификаты</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="dd131bed-f4cf-4ccb-8427-639b59bd5bf2">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

KanatERPSukhova.КанатАдаптация/src/Documents/ЗаказНаПроизводство2_2/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура КАНАТ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//++ Гурьев 01.09.23 Гурьев Вывод реквизита "Комментарий к заказу"
	КолонкаКомментарийКЗаказу = Элементы.Добавить("КАНАТ_ПродукцияКомментарийКЗаказу", Тип("ПолеФормы"), Элементы.Продукция); 
	КолонкаКомментарийКЗаказу.Заголовок = "Комментарий к заказу"; 
	КолонкаКомментарийКЗаказу.ПутьКДанным = "Объект.Продукция.КАНАТ_КомментарийКЗаказу";
	КолонкаКомментарийКЗаказу.Вид = ВидПоляФормы.ПолеВвода;
	//-- Гурьев 01.09.23
	
	//++ Гурьев 13.11.23 ЧТЗ_2.3 Вывод колонки с сертификатом
	КолонкаКомментарийКЗаказу = Элементы.Добавить("КАНАТ_Сертификат", Тип("ПолеФормы"), Элементы.Продукция); 
	КолонкаКомментарийКЗаказу.Заголовок = "Сертификат"; 
	КолонкаКомментарийКЗаказу.ПутьКДанным = "Объект.Продукция.КАНАТ_Сертификат";
	КолонкаКомментарийКЗаказу.Вид = ВидПоляФормы.ПолеВвода;
	//-- Гурьев 13.11.23

КонецПроцедуры
